__author__ = 'Чудесников Никита'

#6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input('Введите номер буквы'))
print ('Это буква ', chr(64+a))
